---
kind: method
id: M:Autodesk.Revit.DB.FabricationConnectorInfo.HasDoubleWallConnector
source: html/5b93b125-c1f4-ad4c-6f51-e87b322f82a5.htm
---
# Autodesk.Revit.DB.FabricationConnectorInfo.HasDoubleWallConnector Method

Checks if there are any double wall connectors fabricated.

## Syntax (C#)
```csharp
public bool HasDoubleWallConnector()
```

## Returns
True if there are any double wall connectors fabricated.